 #산술연산자 익히기
2^10  # 거듭제곱
2**3  # 거듭제곱의 또 다른 표기
6/2   # 나눗셈
5%%2  # 나머지 구하기
5%/%2 # 몫 구하기 
7/2
7%/%2

#비교연산자
3 > 5  # 거짓
3 < 5  # 진실  #(=은 같다xx 대입의 의미)
3 = 5  # 오류 (이퀄은 대입의 기호)
3 == 5    #(상수를 다른 것으호 바꿀수 없다)  
3 == 3

var00 <- 10 #var00는 10으로 간주 됨
var00 

3 != 5  #같지 않다 (부정기호)
        #답은 트루가 나옴(3은 5가 아니니까)
3 <= 5 #이하
3 >= 5 #이상

#논리 연산자
x <- TRUE        #x 변수에 TRUE를 저장
y <- FALSE       #y 변수에 FALSE를 저장
z <- TRUE      #블록지정해서 컨트롤+엔터해야함
v <- FALSE

x | y # OR 연산 (저 작대기는 엔터키 위)
y | v # OR 연산 (하나만 진실이면 진실로 나옴)
x & y # AND 연산(하나만 거짓이면 거짓으로 나옴)
x & z # AND 연산(둘다 진실이면 진실)

# F and T or T  ->결과 False
#(F or T) and F ->
             #괄호가 다른 결과를 준다고 함

!x  #NOT연산 (x는 트루이기 떄문에 답은 페일)
!y







